app/controllers/questions_controller.rb

DELETE FROM "questions" WHERE ("id" IN (1))
INSERT INTO "questions" ("created_at", "good_answer", "updated_at", "a1", "a2", "content", "a3", "a4") VALUES('2010-06-15 21:29:00', 'poprawna', '2010-06-15 21:29:00', 'A', 'B', 'pytanie', 'C', 'D')
---
  def uploadFile
    Question.find(:all).each {|x| x.delete }
        DataFile.save( params[:upload]).each { |row|
      if row[0] != 'pytanie' then
        Question.new(:content => row[0], :a1 => row[1],:a2 => row[2],:a3 => row[3],:a4 => row[4], :good_answer => row[5] ).save

SELECT * FROM "questions"
---
  def index
    @questions = Question.all

SELECT * FROM "questions" WHERE ("questions"."id" = 1)
---
  def show
    @question = Question.find(params[:id])

SELECT * FROM "questions" WHERE ("questions"."id" = 39)
---
  def edit
    @question = Question.find(params[:id])

INSERT INTO "questions" ("created_at", "good_answer", "updated_at", "a1", "a2", "content", "a3", "a4") VALUES('2010-06-01 18:00:58', '7,7 kWh', '2010-06-01 18:00:58', '2,8 kWh', '7,7 kWh', 'Komputer i monitor pracują 5 godzin dziennie, a urządzenie wielofunkcyjne 1 godzinę i 15 minut. Oblicz zużycie energii zestawu komputerowego w ciągu siedmiu dni, jeśli sam komputer pobiera 150 W, monitor pobiera 50 W, a urządzenie wielofunkcyjne pobiera 80 W.', '28 kWh', '10 kWh')
---
  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      @question.good_answer=@question.send(@question.good_answer)
      if @question.save

SELECT * FROM "questions" WHERE ("questions"."id" = 20)
UPDATE "questions" SET "updated_at" = '2010-06-01 18:37:12', "content" = 'Symbol graficzny oznacza układ reagujący na [img]http://img.nopaste.pl/upload/pytanie18_4c0550a88cb3f.jpg[/img]' WHERE "id" = 20
---
  def update
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])

SELECT * FROM "questions" WHERE ("questions"."id" = 3)
DELETE FROM "questions" WHERE "id" = 3
---
  def destroy
    @question = Question.find(params[:id])
    @question.destroy