app/controllers/test_controller.rb

  def index
   @q = Question.all
---
SELECT * FROM "questions"

  def results
   @correct = []
   @points = 0
   params["answer"].each_with_index { |ans,index|
      @correct[index] = {}
      @correct[index]["content"] =  Question.find(ans[0]).content
---
SELECT * FROM "questions" WHERE ("questions"."id" = 46)