app/controllers/user_controller.rb

  def chpass2
       @u=User.find(:first)
       @u.update_attributes(params[:user])
---
UPDATE "users" SET "username" = 'asdf', "password" = 'asdf' WHERE "id" = 1